import math


def area(r: int) -> float:
    '''
    Возвращает площадь круга в формате числа с плавающей точкой.

            Параметры:
                    r (int): радиус круга

            Возвращаемое значение:
                    area (float): площадь круга с радиусом r

            Пример вызова:
                    area(5) -> 78.53981633974483
    '''
    return math.pi * r * r


def perimeter(r: int) -> float:
    '''
    Возвращает периметр круга в формате числа с плавающей точкой.

            Параметры:
                    r (int): радиус круга

            Возвращаемое значение:
                    perimeter (float): периметр круга с радиусом r

            Пример вызова:
                    perimeter(5) -> 31.41592653589793
    '''
    return 2 * math.pi * r

