def area(a: int, b: int) -> int:
    '''
    Возвращает площадь прямоугольника в формате целого числа.

            Параметры:
                    a (int): первая сторона прямоугольника
                    b (int): вторая сторона прямоугольника

            Возвращаемое значение:
                    area (int): площадь прямоугольника со сторонами a и b

            Пример вызова:
                    area(5, 5) -> 25
    '''
    return a * b


def perimeter(a: int, b: int) -> int:
    '''
    Возвращает периметр прямоугольника в формате целого числа.

            Параметры:
                    a (int): первая сторона прямоугольника
                    b (int): вторая сторона прямоугольника

            Возвращаемое значение:
                    perimeter (int): периметр прямоугольника со сторонами a и b

            Пример вызова:
                    perimeter(5, 5) -> 20
    '''
    return (a + b) * 2

