def area(a: int) -> int:
    '''
    Возвращает площадь квадрата в формате целого числа.

            Параметры:
                    a (int): сторона квадрата

            Возвращаемое значение:
                    area (int): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a: int) -> int:
    '''
    Возвращает периметр квадрата в формате целого числа.

            Параметры:
                    a (int): сторона квадрата

            Возвращаемое значение:
                    perimeter (int): периметр квадрата со стороной a
    '''
    return 4 * a

