def area(a: int, h: int) -> float:
    '''
    Возвращает площадь треугольника в формате числа с плавающей точкой.

            Параметры:
                    a (int): основание треугольника
                    h (int): высота треугольника

            Возвращаемое значение:
                    area (float): площадь треугольника с основанием a и высотой
                    h
    '''
    return a * h / 2


def perimeter(a: int, b: int, c: int) -> int:
    '''
    Возвращает периметр треугольника в формате целого числа.

            Параметры:
                    a (int): первая сторона треугольника
                    b (int): вторая сторона треугольника
                    c (int): третья сторона треугольника

            Возвращаемое значение:
                    perimeter (int): периметр треугольника со сторонами a, b и c
    '''
    return a + b + c

